0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 297.15;

boundaryField
{
    inlet
    {
        type            totalTemperature;
        gamma           1.4;
        T0              uniform 297.15;
    }
    
    outlet
    {
        type            zeroGradient;
    }
    
    wall1out
    {
        type            zeroGradient;
    }
    
    wall1in
    {
        type            zeroGradient;
    }
    
    ami2
    {
        type            cyclicAMI;
        value           $internalField;
    }
    
    wall2out
    {
        type            zeroGradient;
    }
    
    wall2in
    {
        type            zeroGradient;
    }
    ami1
    {
        type            cyclicAMI;
        value           $internalField;
    }
}


// ************************************************************************* //
