0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (100 0 0);

boundaryField
{
    inlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
    
    outlet
    {
        type            zeroGradient;
    }
    
    wall1out
    {
        type            fixedValue; // shroud
        value           uniform (0 0 0);
    }
    
    wall1in
    {
        type            fixedValue;
        value           uniform (0 0 0);
    /*
        type            movingWallVelocity;
        value           uniform (0 0 0);
    */
    }
    
    ami2
    {
        type            cyclicAMI;
        value           uniform (0 0 0);
    }
    
    wall2out
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
    wall2in
    {
        type           fixedValue;
        value          uniform (0 0 0);
    }
    
    ami1
    {
        type            cyclicAMI;
        value           $internalField;
    }
    

}


// ************************************************************************* //
