0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    
    outlet
    {
        type            calculated;
        value           $internalField;
    }
    
    ami1
    {
        type            cyclicAMI;
        value           $internalField;
    }
    
    wall2in
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    
    wall2out
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }    
    
    wall1in    // hub
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    
    wall1out   // shroud
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }    
        
    ami2
    {
        type            cyclicAMI;
        value           $internalField;
    }
    

}


// ************************************************************************* //
