0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
pOut            101325;

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform $pOut;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 101325;
    }

    outlet
    {
        type            zeroGradient;
        /*
        type            waveTransmissive;
        field           p;
        psi             thermo:psi;
        gamma           1.4;
        fieldInf        $pOut;
        lInf            5;
        value           uniform $pOut;
        */
    }
    
    wall1out
    {
        type            zeroGradient;
    }
    
    wall1in
    {
        type            zeroGradient;
    }
    
    ami2
    {
        type            cyclicAMI;
        value           $internalField;
    }
    
    wall2out
    {
        type            zeroGradient;
    }
    
    wall2in
    {
        type            zeroGradient;
    }
    
    ami1
    {
        type            cyclicAMI;
        value           $internalField;
    }
    

}


// ************************************************************************* //
