system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0.01;
    }


/*
    "pcorr.*"
    {
        solver          GAMG;
        tolerance       1e-2;
        relTol          0;
        smoother        DICGaussSeidel;
        cacheAgglomeration no;
        maxIter         50;
    }

    p
    {   
        $pcorr;
        tolerance       1e-5;
        relTol          0.01;
    }
*/    
    
    pFinal
    {
        $p;
        relTol          0;
    }
/*
    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0;
    }
*/    
    
    "(rho|U|k|omega|e)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        //smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
    }

    "(rho|U|k|omega|e)Final"
    {
        $U;
        relTol          0;
    }
}

SIMPLE
{
    residualControl
    {
        p               1e-4;
        U               1e-4;
        "(k|omega|e)"   1e-4;
    }
    
    nNonOrthogonalCorrectors 0;
    pMinFactor             0.1;
    pMaxFactor               2;
}


PIMPLE
{
    nCorrectors              2;
    nNonOrthogonalCorrectors 1;
    nOuterCorrectors         1;
    pMinFactor             0.1;
    pMaxFactor               2;
}

relaxationFactors
{
    equations
    {
        ".*"                 1;
    }
}

/*
PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 2;
    pRefCell        0;
    pRefValue       0;
}

*/
// ************************************************************************* //
